Функция ОтказПроведения(НазваниеДокумента, НазваниеТаблицы, Ссылка, Склад, МоментВремени) Экспорт
	Отказ = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	"+НазваниеДокумента+".Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ДанныйОбъект
		|ИЗ
		|	Документ."+НазваниеДокумента+"."+НазваниеТаблицы+" КАК "+НазваниеДокумента+"
		|ГДЕ
		|	"+НазваниеДокумента+".Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВТ_ДанныйОбъект.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТ_ДанныйОбъект КАК ВТ_ДанныйОбъект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				&Период,
		|				Склад = &Склад
		|					И Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТ_ДанныйОбъект.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТ_ДанныйОбъект КАК ВТ_ДанныйОбъект)) КАК ТоварыНаСкладахОстатки
		|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ВТ_ДанныйОбъект.Номенклатура)
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Недостаточно товара " + ВыборкаДетальныеЗаписи.Номенклатура + "! Не хватает " + (-ВыборкаДетальныеЗаписи.КоличествоОстаток) + "шт.");
		Отказ = Истина;
	КонецЦикла;
	Возврат Отказ;
КонецФункции