
&НаКлиенте
Процедура ЗаполнитьМатериалы(Команда)
	ЗаполнитьМатериалыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыНаСервере()	
	Для Каждого СтрТЗ Из Объект.ГотоваяПродукция Цикл 		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СпецификацииМатериалы.Наименование КАК Наименование,
			|	СпецификацииМатериалы.Количество КАК Количество
			|ИЗ
			|	Справочник.Спецификации.Материалы КАК СпецификацииМатериалы
			|ГДЕ
			|	СпецификацииМатериалы.Ссылка.Наименование = &Продукция";
		
		Запрос.УстановитьПараметр("Продукция", СтрТЗ.Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Наименование);
			ПодходящиеСтроки = Объект.Материалы.НайтиСтроки(СтруктураОтбора);
			Если ПодходящиеСтроки.Количество() < 1 Тогда			
				НовМат = Объект.Материалы.Добавить();
				НовМат.Номенклатура = ВыборкаДетальныеЗаписи.Наименование;
				НовМат.Количество = ВыборкаДетальныеЗаписи.Количество * СтрТЗ.Количество;
			Иначе
				ПодходящиеСтроки[0].Количество = ВыборкаДетальныеЗаписи.Количество * СтрТЗ.Количество; 
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;		
КонецПроцедуры
