
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВзаиморасчетыСКонтрагентами Приход
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Баланс = ТекСтрокаСписокСотрудников.СуммаНадбавки;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеНадбавокЗаПродажи") Тогда
		// Заполнение шапки
		ПроцентНадбавки = ДанныеЗаполнения.ПроцентНадбавки;
		Для Каждого ТекСтрокаСписокСотрудников Из ДанныеЗаполнения.СписокСотрудников Цикл
			НоваяСтрока = СписокСотрудников.Добавить();
			НоваяСтрока.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
			НоваяСтрока.СуммаНадбавки = ТекСтрокаСписокСотрудников.СуммаНадбавки;
			НоваяСтрока.СуммаПродаж = ТекСтрокаСписокСотрудников.СуммаПродаж;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
