&НаКлиенте
Процедура РасчетСтоимостиТовара(Элемент)
	Элементы.Товары.ТекущиеДанные.Стоимость = Элементы.Товары.ТекущиеДанные.Цена * Элементы.Товары.ТекущиеДанные.Количество;	
КонецПроцедуры

&НаКлиенте
Процедура РасчетСтоимостиУслуги(Элемент)
	Элементы.Услуги.ТекущиеДанные.Стоимость = Элементы.Услуги.ТекущиеДанные.Цена * Элементы.Услуги.ТекущиеДанные.Количество;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦены(Команда)
	ВидЦеныСтрока = Элементы.ВидЦены.ВыделенныйТекст;
	Для Каждого ПозицияТовара Из Объект.Товары Цикл
		Цена = ЗаполнениеЦен.ЦенаДанногоВида(ПозицияТовара.Номенклатура, ВидЦеныСтрока);
		Если Цена Тогда
			ПозицияТовара.Цена = Цена;
			ПозицияТовара.Стоимость = Цена * ПозицияТовара.Количество; 
		КонецЕсли;
	КонецЦикла;
	Для Каждого ПозицияУслуги Из Объект.Услуги Цикл
		Цена = ЗаполнениеЦен.ЦенаДанногоВида(ПозицияУслуги.Номенклатура, ВидЦеныСтрока);
		Если Цена Тогда
			ПозицияУслуги.Цена = Цена;
			ПозицияУслуги.Стоимость = Цена * ПозицияУслуги.Количество;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры