
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.СписокСотрудников.Очистить();	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Продажи.Менеджер КАК Менеджер,
		|	СУММА(Продажи.Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Продажи КАК Продажи
		|ГДЕ
		|	Продажи.Период >= &НачПериод
		|	И Продажи.Период <= &КонПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	Продажи.Менеджер"; 
	
	ПрошлыйМесяц = ДобавитьМесяц(ТекущаяДата(), -1);
	Запрос.УстановитьПараметр("НачПериод", НачалоМесяца(ПрошлыйМесяц));
	Запрос.УстановитьПараметр("КонПериод", КонецМесяца(ПрошлыйМесяц));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрСотр = Объект.СписокСотрудников.Добавить();
		СтрСотр.Сотрудник = ВыборкаДетальныеЗаписи.Менеджер;
		СтрСотр.СуммаПродаж = ВыборкаДетальныеЗаписи.Сумма;
		СтрСотр.СуммаНадбавки = ВыборкаДетальныеЗаписи.Сумма * Объект.ПроцентНадбавки / 100; 
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА			
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ПроцентНадбавки = 0 Тогда 
		Объект.ПроцентНадбавки = Константы.ПроцентНадбавокЗаПродажи.Получить();
	КонецЕсли;
КонецПроцедуры
