
&НаКлиенте
Процедура СоздатьЗаказПоставщику(Команда)
	НовыйЗаказ = СоздатьНовыйЗаказ(Склад, Поставщик, ВидЦеныЗакупки);
	Если НовыйЗаказ = NULL Тогда
		Сообщить("На складе "+Склад+" нет отрицательных остатков");
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", НовыйЗаказ);
		ОткрытьФорму("Документ.ЗаказПоставщику.Форма.ФормаДокумента", ПараметрыФормы);
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьНовыйЗаказ(Склад, Поставщик, ВидЦеныЗакупки)
	Таб = ПолучитьОтрицательныеОстатки(Склад);
	ВозвратСсылка = NULL;
	Если Таб.Количество() > 0 Тогда
		НовыйЗаказ = Документы.ЗаказПоставщику.СоздатьДокумент();
		НовыйЗаказ.Поставщик = Поставщик;
		НовыйЗаказ.ВидЦены = ВидЦеныЗакупки;
		
		Для Каждого Стр Из Таб Цикл
			НовСтрТовары = НовыйЗаказ.Товары.Добавить();
			НовСтрТовары.Номенклатура = Стр.Номенклатура;
			НовСтрТовары.Цена = ЗаполнениеЦен.ЦенаДанногоВида(Стр.Номенклатура, Строка(ВидЦеныЗакупки));  
			НовСтрТовары.Количество = -Стр.Количество;
			НовСтрТовары.Стоимость = НовСтрТовары.Цена * НовСтрТовары.Количество; 
		КонецЦикла; 
		НовыйЗаказ.Дата = ТекущаяДата();
		НовыйЗаказ.Записать();
		ВозвратСсылка = НовыйЗаказ.Ссылка; 
	КонецЕсли;
	Возврат ВозвратСсылка;	
КонецФункции


&НаСервере
Функция ПолучитьОтрицательныеОстатки(Склад)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	    |ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток < 0";
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Таб = Новый ТаблицаЗначений;
	Таб.Колонки.Добавить("Номенклатура");
    Таб.Колонки.Добавить("Количество");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		    Стр = Таб.Добавить();
			Стр.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			Стр.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;	
	Возврат Таб;
КонецФункции

