&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Для Каждого Стр Из Строки Цикл
		Если Стр.Ключ.Родитель.Наименование = "Поставщики" Тогда
			
			НаборЗаписей = РегистрыСведений.МаркерыРискаПоставщиков.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Поставщик.Установить(Стр.Ключ);
			НаборЗаписей.Прочитать(); 
			
			Маркер = "<не установлен>";
			Для Каждого Запись Из НаборЗаписей Цикл
				Маркер = Запись.МаркерРиска; 			
			КонецЦикла;
			
			Если НЕ (Маркер = "<не установлен>") Тогда
				Если Маркер = "красный" Тогда
					Цвет = WebЦвета.Коралловый;
				ИначеЕсли Маркер = "желтый" Тогда
					Цвет = WebЦвета.Желтый;
				ИначеЕсли Маркер = "зеленый" Тогда
					Цвет = WebЦвета.ЗеленоватоЖелтый;
				КонецЕсли;
				Стр.Значение.Оформление["Наименование"].УстановитьЗначениеПараметра(
					"ЦветФона", Цвет);
			КонецЕсли;
		КонецЕсли;    		
	КонецЦикла;
КонецПроцедуры

